# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install Tools
brew 'stow'
brew 'sleepwatcher'
brew 'eza'
brew 'grep'
brew 'awscli'
brew 'diff-so-fancy'
brew 'fzf'
brew 'findutils'
brew 'git'
brew 'gh'
brew 'gnu-sed'
brew 'htop'
brew 'kubectx'
brew 'jq'
brew 'kubernetes-cli'
brew 'k9s'
brew 'helm'
brew 'nmap'
brew 'neovim'
brew 'wget'
brew 'yq'
brew 'ripgrep'
brew 'bat'
brew 'fd'

# Development
brew 'openssl@3'
brew 'postgresql@16'
brew 'tflint'
brew 'hadolint'
brew 'shfmt'
brew 'shellcheck'
brew 'yarn'
brew 'podman'
brew 'direnv'
brew 'docker'
brew 'docker-buildx'
brew 'docker-compose'
brew 'docker-credential-helper-ecr'
brew 'mise'
brew 'terraform-ls'
brew 'bash-language-server'

# Font
cask 'font-jetbrains-mono-nerd-font'
cask 'ghostty'
cask 'beekeeper-studio'
cask 'chromedriver'
cask 'maccy'
cask 'zed'
cask 'visual-studio-code'
cask 'rectangle'
