# Taps
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'

# Install ZSH
brew 'zsh'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'grep'

# Install Tools
brew 'awscli'
brew 'git'
brew 'git-lfs'
brew 'wget'
brew 'parallel'
brew 'fzf'
brew 'htop'
brew 'gnu-sed'
brew 'diff-so-fancy'
brew 'httping'
brew 'kops'
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'nmap'
brew 'vim'
brew 'zplug'

# Development
brew 'mysql'
brew 'postgresql@9.6'
brew 'go'
brew 'openssl'
brew 'node-build'
brew 'ruby-build'
brew 'rbenv'
brew 'nodenv'
brew 'jenv'
brew 'pyenv'
brew 'terraform'
brew 'packer'
brew 'erlang'
brew 'elixir'
brew 'yarn'
brew 'swiftlint'
brew 'shellcheck'
brew 'hadolint'

# Apps
# cask 'docker'
# cask 'firefox'
# cask 'google-chrome'
# cask 'google-chrome-canary'
# cask 'visual-studio-code'
# cask 'java'
# cask 'iterm2'
# cask 'sequel-pro'
# cask 'spotify'
# cask 'slack'
# cask 'tunnelbear'
# cask 'postman'
# cask 'insomnia'
# cask 'vlc'
# cask 'spectacle'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vagrant'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Font
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-fira-mono-for-powerline'

