# .zsh_plugins.txt
# https://getantidote.github.io/usage

mattmc3/ez-compinit
zsh-users/zsh-completions kind:fpath path:src

belak/zsh-utils path:completion/functions kind:autoload post:compstyle_zshzoo_setup

agkozak/zsh-z
romkatv/powerlevel10k

mattmc3/zephyr path:plugins/color

zsh-users/zsh-syntax-highlighting
zsh-users/zsh-autosuggestions
zsh-users/zsh-history-substring-search
