# .zsh_plugins.txt
# https://getantidote.github.io/usage

zsh-users/zsh-completions kind:fpath path:src
mattmc3/ez-compinit

agkozak/zsh-z
romkatv/powerlevel10k kind:fpath

ohmyzsh/ohmyzsh path:plugins/colored-man-pages
ohmyzsh/ohmyzsh path:plugins/terraform

mattmc3/zephyr path:plugins/directory
mattmc3/zephyr path:plugins/color
mattmc3/zephyr path:plugins/completion

zdharma-continuum/fast-syntax-highlighting kind:defer
zsh-users/zsh-autosuggestions
zsh-users/zsh-history-substring-search
